app/controllers/unidades_controller.rb

SELECT "unidades".* FROM "unidades"  ORDER BY "unidades"."sigla" ASC
---
  def index
    @unidades = Unidade.all.order(:sigla)

INSERT INTO "unidades" ("sigla", "nome", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sigla", "IFILO"], ["nome", "Instituto de Filosofia"], ["created_at", "2015-12-30 20:56:22.501948"], ["updated_at", "2015-12-30 20:56:22.501948"]]
---
  def create
    @unidade = Unidade.new(unidade_params)

    if @unidade.save